# CannotMakeRoofFromVerticalFaceError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotMakeRoofFromVerticalFaceError Property
BuiltInFailures..::..CreationFailures Class See Also
---
Can't make roof from vertical face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMakeRoofFromVerticalFaceError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMakeRoofFromVerticalFaceError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMakeRoofFromVerticalFaceError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace